~Cases/BasicFluidFlow/simpleFoam_pressureDriven/system/probes
// -*- C++ -*-

probesFluid
{
    type            probes;
    libs            (sampling);
    writeControl    timeStep;
    writeInterval   1;
    interpolationScheme cell;
    region          region0;
    log             true;
    verbose         true;

    fields          (p U);

    probeLocations
    (
        (0 0 0)
		(0 0.001 0.001)
    );
}

MassFlowRate_inlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    enabled         yes;
    writeControl    timeStep;
    writeInterval   5;
    log             yes;
    writeFields     no;
    regionType      patch;
    name            inlet;
    operation       sum;
    fields          (phi);
    region          region0;
}

MassFlowRate_outlet
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    enabled         yes;
    writeControl    timeStep;
    writeInterval   5;
    log             yes;
    writeFields     no;
    regionType      patch;
    name            outlet;
    operation       sum;
    fields          (phi);
    region          region0;
}

inletAve_Values
{
    // Mandatory entries
	type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
	enabled			yes;
	writeControl    timeStep;
    writeInterval   5;
	log				yes;
	writeFields		no;
	operation		average;
	regionType		patch;
	fields			(U p);
	name			inlet;
	region			region0;

}

outletAve_Values
{
    // Mandatory entries
	type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
	enabled			yes;
	writeControl    timeStep;
    writeInterval   5;
	log				yes;
	writeFields		no;
	operation		average;
	regionType		patch;
	fields			(U p);
	name			outlet;
	region			region0;

}

MinMaxT
{
    type    multiRegion;
    libs    (utilityFunctionObjects);

    // regions ( ".*region0" );

    function
    {
        // Actual object specification
        type    fieldMinMax;
        libs    (fieldFunctionObjects);
        fields  (U);
    }
}

volAvgFluid
{
	type            volFieldValue;
	libs            ("libfieldFunctionObjects.so");
	log             true;
	//writeControl    timeStep;//writeTime;//timeStep;//writeTime;
	writeFields     false;
	regionType      all;//cellZone;
	region          region0;
	name            region0;
	operation       volAverage;
	weightField     none;//alpha1;
	fields
	(
		U
	);
}


solverInfo1
{
#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

writeControl writeTime;

fields      (U);

writeFields yes;
log         true;
}

// ************************************************************************* //
